var express = require('express'),
	jade = require('jade');

var server = express();
server.listen(8020);

var listRouter = express.Router();

var arr = [
	'谷歌推出新功能:在地图上对餐厅投票 决定去哪里吃饭',
	'荣耀为何能快速崛起？赵明这次的北大宣讲给出了答案',
	'科技巨头公司深陷隐私保护漩涡 | 脸书5000万用户信息泄露...',
	'三星、苹果超级旗舰对比评测，谁能夺得机皇之名？',
	'专利大战 高通与苹果吵架 受牵连的却是Inter',
	'全球首款！OPPO即将推出运存10GB的旗舰机：骁龙845+...',
	'假如马斯克被踢出特斯拉？别急，苹果、Twitter的CEO都..',
	'酒吧现白色法拉利458，车内下来一女子，身材曼妙引众人盯',
	'能轻松支撑千枚导弹运作！中国此工程将成，当前仅俄国拥有',
	'谷歌推出新功能:在地图上对餐厅投票 决定去哪里吃饭-2',
	'荣耀为何能快速崛起？赵明这次的北大宣讲给出了答案-2',
	'科技巨头公司深陷隐私保护漩涡 | 脸书5000万用户信息泄露...-2',
	'三星、苹果超级旗舰对比评测，谁能夺得机皇之名-2？',
	'专利大战 高通与苹果吵架 受牵连的却是Inter-2',
	'全球首款！OPPO即将推出运存10GB的旗舰机：骁龙845+...-2',
	'假如马斯克被踢出特斯拉？别急，苹果、Twitter的CEO都..-2',
	'酒吧现白色法拉利458，车内下来一女子，身材曼妙引众人盯-2',
	'能轻松支撑千枚导弹运作！中国此工程将成，当前仅俄国拥有-2',
	'谷歌推出新功能:在地图上对餐厅投票 决定去哪里吃饭-3',
	'荣耀为何能快速崛起？赵明这次的北大宣讲给出了答案-3',
	'科技巨头公司深陷隐私保护漩涡 | 脸书5000万用户信息泄露...-3',
	'三星、苹果超级旗舰对比评测，谁能夺得机皇之名-3？',
	'专利大战 高通与苹果吵架 受牵连的却是Inter-3',
	'全球首款！OPPO即将推出运存10GB的旗舰机：骁龙845+...-3',
	'假如马斯克被踢出特斯拉？别急，苹果、Twitter的CEO都..-3',
	'酒吧现白色法拉利458，车内下来一女子，身材曼妙引众人盯-3',
	'能轻松支撑千枚导弹运作！中国此工程将成，当前仅俄国拥有-3',
];
var maxl = Math.ceil(arr.length/4);

server.use('/list',listRouter);

listRouter.use('/index',function(req,res){
	// console.log(req.query);
	var needArr = arr.slice((req.query.page-1)*4,req.query.page*4,4);
	var str = jade.renderFile('./1.jade',{pretty: true,listArr: needArr,maxl: maxl,index: req.query.page});
	res.send(str);
});	